package swu.cp316.cafe

import android.content.Intent
import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import androidx.recyclerview.widget.LinearLayoutManager
import androidx.recyclerview.widget.RecyclerView
import swu.cp316.cafe.databinding.ActivitySecondBinding

class SecondActivity : AppCompatActivity() {

    private lateinit var binding: ActivitySecondBinding

    //ชื่อร้าน
    var cafe = arrayOf(
        "NANA Hunter Coffee Roasters ",
        " Patom Organic Living",
        "Camin Cuisine & Cafe ",
        "Nature Garden Cafe",
        "Babyccino",
        "OTHER CAFE ",
        "Lots.Sathon",
        "Tealily Cafe ",
        "Organic Supply ",
        "Brioche from heaven ",
        "TANGIBLE BANGKOK",
        "CRAFT at Kimpton Maa-lai Bangkok",
        "NANA Coffee Roasters Ari ",
        "Snog XX",
        "Chanintr Work "

    )

    //ที่ตั้ง
    var description = arrayOf(
        "นานาฮันเตอร์ สาขา พรานนก - พุทธมณฑล สาย 4 คาเฟ่ขนาดใหญ่ สไตล์อินดัสเทรียลโมเดิร์น ไม่เหมือนใครโดยจำลองโรงคั่วกาแฟขึ้นมา เปิดประตูเข้าไปจะเจอกับความอลังของร้าน พาสู่โลกกาแฟในยุคเก่า มีเครื่องดื่มเด็ดๆ อย่างเช่น Nitro Cold Brew, Dirty, Syphon และ Drip เป็นต้น ยังมีเมล็ดกาแฟให้เราเลือกชิม เลือกซื้อกลับบ้านทำเองได้ด้วย..\n" +
                "\n" +
                "ที่อยู่ : 288 ถนนพรานนก - พุทธมณฑลสาย 4 แขวงบางพรม เขตตลิ่งชัน กรุงเทพมหานคร 10170\n" +
                "พิกัด : https://goo.gl/maps/q3KuHK1yZN7A1a4w6\n" +
                "เปิดบริการ : จ. - ศ. 07.00 – 18.00 น. / ส. - อา. 08.00 – 18.00 น.\n" +
                "โทร. 065 919 3991\n" +
                "เว็บไซต์ : www.facebook.com/nanahuntercoffee",
        "ร้านออร์แกนิกคาเฟ่ เป็นลักษณะห้องนั่งเล่นกลาสเฮ้าส์ในสวน ใจกลางทองหล่อ และมีต้นไม้รอบล้อม ภายในร้านจำหน่ายผลิตภัณฑ์ และเมนูสุขภาพจากวัตถุดิบออร์แกนิคคัดเลือกมาจากสวนสามพราน จ.นครปฐม รายได้จากการจำหน่าย 3% มอบให้กับมูลนิธิสังคมสุขใจอีกด้วยอิ่มท้องแล้ว อิ่มบุญไปด้วยนะ\n" +
                "\n" +
                "ที่อยู่ : 9, 2 ซอยพร้อมพรรค แขวงคลองตันเหนือ เขตวัฒนา กรุงเทพมหานคร 10110\n" +
                "พิกัด : https://goo.gl/maps/1ZoFPqbskFvZQeNw7\n" +
                "เปิดบริการ : อ. – อา. เวลา 9.30 น. – 18.00 น.\n" +
                "โทร : 02 084 8649\n" +
                "เว็บไซต์ : www.patom.com",
        "ร้านคาเฟ่สไตล์ในสวนกลางเมือง พร้อมหมอกจางๆ รื่นลม พืชไม้สีเขียว และบ่อปลากับ บรรยายกาศชวนพักผ่อน พักสายตา ในวันเบาๆ มีขนม และเมนูเครื่องดื่มน่าทานอย่างมากผสมผสานเข้ากับความเป็นไทยเข้าไปด้วย\n" +
                "\n" +
                "ที่อยู่ : 151/3 ซอยประเสริฐมนูกิจ 2 แขวงเสนานิคม เขตจตุจักร กรุงเทพมหานคร 10900\n" +
                "พิกัด : https://goo.gl/maps/zroU8vfFZwubjKJ68\n" +
                "เปิดบริการ : ทุกวัน 8.00 – 22.00 น.\n" +
                "โทร. 0956156615\n" +
                "เว็บไซต์ :  www.facebook.com/camin.cuisineandcafe.th",
        "คาเฟ่ในสวนลิ้นจี่ 8 ไร่ อายุ 100 ปี ริมคลองบางขุนเทียน พระราม 2 อนุรักษ์พื้นที่วิถีดั้งเดิมของคนที่นี่ เมนูซิกเนเจอร์เมี่ยงตะลิงปิง ตะลิงปิงผสมโซดา เค้กตะลิงปิง พร้อมอาหารประจำย่านคลองบางขุนเทียน อย่าง มัสมั่น แกงคั่วขาว ผัดไทย ไข่พะโล้ และอีกหลากหลายความอร่อย..\n" +
                "\n" +
                "ที่อยู่ : 9, 3 หมู่ 6 ถนนจอมทอง แขวงจอมทอง เขตจอมทอง กรุงเทพมหานคร 10150\n" +
                "พิกัด : https://goo.gl/maps/Xs1yuLnnmUx4vBT6A\n" +
                "เปิดบริการ : ทุกวัน 10.00 – 18.00 น.\n" +
                "โทร. 0851231386\n" +
                "เว็บไซต์ :  www.facebook.com/NaturaBKK",
        "คาเฟ่ใจกลางย่านเอกมัย 12 ร้านออกแบบแนวมินิมอล \"European Luxury Minimal Style\" สร้างบรรยายกาศของความอบอุ่นของร้าน ใส่ใจตั้งแต่การตกแต่งหน้าร้านเลยล่ะ พร้อมอิ่มกับเมนูอาหาร เครื่อมดื่มและขนมสไตล์โฮมเมดอร่อยๆ\n" +
                "\n" +
                "ที่อยู่ : 53 ซ. เอกมัย 12 เเขวง คลองตันเหนือ เขตวัฒนา กรุงเทพมหานคร 10110\n" +
                "พิกัด : https://g.page/babyccinobkk\n" +
                "เปิดบริการ :  ทุกวัน 8.00 – 18.00 น.\n" +
                "โทร. 0803624965\n" +
                "เว็บไซต์ : www.facebook.com/babyccinobkk",
        "คาเฟ่ร้านกาแฟสุดเก๋ สไตล์การตกแต่งแบบ Minimal Rustic ให้บรรยากาศคลีน ๆ ด้วยวัสดุอิฐบล็อก หิน ปูนเปลือย บล็อกแก้ว แบบโชว์พื้นผิวและแนวไฟแบบเป็นเส้น ตวัดไปมา ซึ่งได้รับแรงบันดาลใจมาจากอิทธิพลของสนีคเกอร์แฟชั่น ทำให้ร้านนี้ดีสวยเท่ไม่ซ้ำใคร เมนูของร้าน มีทั้งกาแฟ ชา ช็อคโกแลต นม โซดา กาแฟสกัดเย็นแบบ Cold Drip และขนมเบนเย่ สามารถนั่งทานที่ร้านได้ ถ่ายรูปชิค ๆ ได้อย่างสบายใจ\n" +
                "\n" +
                "ที่อยู่ : 01/7 ซอยรางน้ำ พญาไท ราชเทวี กรุงเทพฯ\n" +
                "พิกัด : https://goo.gl/maps/dn9NG1w1FtiynmbYA\n" +
                "เปิดบริการ : ทุกวัน 8.00 น. – 20.00 น.\n" +
                "โทร. 080 949 5326\n" +
                "เว็บไซต์ :  www.facebook.com/othercafe8",
        "คาเฟ่มินิมอลสไตล์ญี่ปุ่น ย่านสาทร เป็นร้านที่มีที่จอดรถมาก ตามชื่อร้านถือว่าเป็นร้านที่ใครหลายคนไปซ้ำกันตลอด เพราะมีความหลากหลาย ตัวร้านตกแต่งเรียบง่ายตู้คอนเทรนเนอร์ขาว กระจกรอบด้าน อบอุ่นสบายตา ไม่เบื่อง่ายๆ สายชิล สายแฮกเอ้าท์ สายไหนก็ต้องมา ทั้งอาหาร เครื่องดื่ม กาแฟ ร้อน เย็น และขนมอบอร่อยๆ\n" +
                "\n" +
                "ที่อยู่ : 43/1 ซอย นราธิวาสราชนครินทร์ 7 แขวง ทุ่งมหาเมฆ เขต สาทร กรุงเทพมหานคร 10120\n" +
                "พิกัด : https://goo.gl/maps/Y94oatHtuwmuMopq6\n" +
                "เปิดบริการ : จ. - พฤ. 8.00 -20.00 น., ส. - อา. 9.00 – 22.00 น. และ 8.00 – 22.00 น.\n" +
                "โทร. 0838264456\n" +
                "เว็บไซต์ :  www.facebook.com/Lots.Sathon",
        "คาเฟ่ชาเขียวลับสไตล์ญี่ปุ่น คงรสชาติของชาเขียวต้นตำหรับกลางซอยเอกมัย 12 บรรยายกาศอบอุ่นเหมือนอยู่บ้านในคอนเซ็ปต์ Tea House เห็นครั้งแรกก็ชวนให้ตกหลุมรัก เมนูชาเขียวรสชาติเข้มข้นในแบบฉบับดั้งเดิม โดยคัดชาเขียวคุณภาพจากเมือง Uji แหล่งผลิตชาเขียวคุณภาพของญี่ปุ่น เมนูเด็ดของที่นี่ Hot Matcha Latte, Matcha Snowflake, Matcha Shiratama Dango, Yuzu Sorbet และ Houjicha\n" +
                "\n" +
                "ที่อยู่ : 15/25 สุขุมวิท 63 เอกมัย 12 หมู่บ้านสวนเจริญใจ คลองตัน, เขตวัฒนา\n" +
                "พิกัด : https://goo.gl/maps/bn35hhd26FJeosLs9\n" +
                "เปิดบริการ : พฤ. - จ. 10.00 – 17.00 น.\n" +
                "โทร. 020776961\n" +
                "เว็บไซต์ :  www.facebook.com/tealilycafe",
        "ร้านคาเฟ่สไตล์สายสุขภาพเจ้าดัง ตามเทรนด์กันหน่อยสำหรับคนรักสุขภาพออกแบบร้านโล่งโปร่งสบาย มีเมนูผักปั่นผลไม้ปั่น DT 148, Super Berry, S Coco, O.S. Gargen น้ำสกัดเย็น ขนมและเค้กสูตรพิเศษ Vegan พร้อมทั้งจำหน่ายสินค้าสุขภาพตั้งแต่ข้าวสาร อาหารแห้ง ผลิตภัณฑ์ และสกินแคร์มีหลากหลาย\n" +
                "\n" +
                "ที่อยู่ : 148 ถ. นาคนิวาส แขวง ลาดพร้าว เขตลาดพร้าว กรุงเทพมหานคร 10230\n" +
                "พิกัด : https://goo.gl/maps/ezWrBsfEBZ1Jq6gL7\n" +
                "เปิดบริการ : ทุกวัน 10.00 - 20.00 น.\n" +
                "โทร. 021016410\n" +
                "เว็บไซต์ :  www.facebook.com/organicsupply.bkk/",
        "ร้านขนมเหมือนยกคาเฟ่ฝรั่งเศสมาไว้ย่านสาทร ออกแบบร้านด้วยผนังอิฐและท่อนฟืนบรรยายการเหมือนโรงอบขนม ส่งต่อความอบอร่อยจาก เชฟไก่ เชฟกระทะเหล็กอาหารหวานประเทศไทย ด้วยเมนูเด็ดด้วยขนมปังบริยอชสูตรออริจินัลหนานุ่ม สดใหม่จากเตา และเบเกอรี่หลากหลายพูดแล้วหิวเลย อย่างเมนู Brioche From Heaven,Yusu Meringue Tart, Affogato From Heaven\n" +
                "\n" +
                "ที่อยู่ : 156 ถนน สีลม แขวง สีลม เขตบางรัก กรุงเทพมหานคร 10500\n" +
                "พิกัด : https://g.page/brioche-from-heaven\n" +
                "เปิดบริการ : ทุกวัน 9.30 – 19.30 น.\n" +
                "โทร. 0648470049\n" +
                "เว็บไซต์ :  www.facebook.com/Brioche-from-heaven",
        "คาเฟ่ร้านกาแฟทะเลทราย ดีไซน์โดย Trimode Studio สตูดิโอออกแบบและตกแต่งภายใน ใช้ไอเดียตกแต่งด้วยหิน กรวดโทนสีเทา สร้างความโมเดิร์น เท่ เรียบ ให้กับร้านคาเฟ่ มีเมนูแนะนำ Banana Cake, Concrete, Matcha Green Tea, Cold Brew Honey Yuzu\n" +
                "\n" +
                "ที่อยู่ : ซอยมาตานุสรณ์ แขวงบางคอแหลม เขตบางคอแหลม กรุงเทพมหานคร 10120\n" +
                "พิกัด : https://goo.gl/maps/vLXdczHAsA63ftr29\n" +
                "เปิดบริการ : พ. - จ. 9.00 – 17.30 น. (ปิดวันอังคาร)\n" +
                "โทร. 0813760402\n" +
                "เว็บไซต์ : www.facebook.com/Tangiblebkk\n" +
                "\n",
        "คาเฟ่สำหรับวันสบายๆ พักผ่อนในสวนของโรงแรมห้าดาว ที่ Kimpton Maa-lai Bangkok ซึ่งมาพร้อมกับคอนเซ็ปต์ Pet-Friendly ที่เปิดให้ลูกค้าของโรงแรมและคาเฟ่นำสัตว์เลี้ยงเข้ามาได้อย่างสบายใจ พื้นที่กว้างมีที่นั่งหลากหลาย บาร์ โซฟานั่งสบายๆ จิบกาแฟชมสวนธรรมชาติล้อมรอบตัว ทางร้านมีเมนูที่คัดสรรมามาเสิร์ฟตั้งแต่อาหาร ขนม และเครื่อมงดื่ม กาแฟแบบ Syphon หรือ Drip ก็ได้ ของทานเล่นอย่าง Avocado Toast ก็ดีนะ\n" +
                "\n" +
                "ที่อยู่ : Kimpton Maa-Lai Bangkok, 78 ซอยต้นสน แขวงลุมพินี เขตปทุมวัน กรุงเทพมหานคร 10330\n" +
                "พิกัด : https://goo.gl/maps/FXUb7RBibtBzjLsT8\n" +
                "เปิดบริการ : ทุกวัน 7.00 – 23.00 น.\n" +
                "โทร. 02 056 9999\n" +
                "เว็บไซต์ : www.kimptonmaalaibangkok.com/bangkok-restaurants/craft",
        "ร้านคาเฟ่อีกแห่งของ NANA Coffee ที่สามารถออกแบบร้านกาแฟให้ดูแปลกตาเข้ามาถ่ายรูปเช็คอินพร้อมเครื่องดื่มและขนม ที่ใครหลายๆ คน คงติดใจร้านนี้ไปแล้ว มีกาแฟให้เลือกหลากหลายรูปแบบที่ต้องการเลย\n" +
                "\n" +
                "ที่อยู่ : 24/2 ซอยอารีย์ 4 แขวงสามเสนใน เขตพญาไท กรุงเทพมหานคร 10400\n" +
                "พิกัด : https://goo.gl/maps/AcUxtYJvX8VS331HA\n" +
                "เปิดบริการ : ทุกวัน 7.00 – 18.00 น.\n" +
                "โทร : ไม่ระบุ\n" +
                "เว็บไซต์ : www.nanacoffeeroasters.com\n" +
                "\n",
        "ร้าน Snog XX คาเฟ่ย่านรามอินทรา ร้านกาแฟรสชาติดี บรรยายกาศชิลๆ มีที่จอดรถกาแฟมีให้เลือกหลายรูปแบบ เริ่มต้น 100 บาทขึ้นไป มีทั้งเมนูร้อน เย็น เมนูกาแฟและเครื่องดื่มอื่นๆ ชาเขียวหรือช็อคโกแลต ขนมก็น่าทาน บราวนี่ ทิรามิสุ ช็อคโกแลตทาร์ต และสโคน กับไอศครีมของแบรนด์ Guss Damm Good ด้วยนะ\n" +
                "\n" +
                "ที่อยู่ : 144 ซอยโยธินพัฒนา คลองจั่น เขตบางกะปิ กรุงเทพมหานคร 10240\n" +
                "พิกัด : https://g.page/snog-xx?share\n" +
                "เปิดบริการ : ทุกวัน 8.00 – 20.00 น.\n" +
                "โทร : 080 221 1188\n" +
                "เว็บไซต์ : www.snogxx.com",
        "คาเฟ่จำลองโกดัง ที่เปลี่ยนรูปแบบจากโกดัง Warehouse26 มาเป็นโชว์รูมเฟอร์นิเจอร์สุดเก๋จากแบรนด์ชื่อดังด้านเฟอร์นิเจอร์อย่าง Chanintr โดยจำลองให้โกดังเป็น \"Living Office\" สไตล์คนทำงาน โดยเน้นโทนสีขาวสบายตาทันสมัย ให้แสงสว่างถ่ายมุมไหนก็สวย ก็ดูดีไปหมด มีโซน Coffee Bar at Chanintr Work ชมสินค้าเหนื่อย ก็มีเครื่องดื่มบริการ ชื่นใจที่สุดเลย\n" +
                "\n" +
                "ที่อยู่ : 110 ซอย สุขุมวิท 26 เขตคลองเตย กรุงเทพมหานคร 10110\n" +
                "พิกัด : https://goo.gl/maps/XFWh2CVLnfxbgTue6\n" +
                "เปิดบริการ : ทุกวัน 10.00 – 19.00 น.\n" +
                "โทร : 02 059 7760\n" +
                "เว็บไซต์ : www.facebook.com/ChanintrWork",

    )

    //ที่ตั้ง
    var place = arrayOf(
                "ที่อยู่ : 288 ถนนพรานนก - พุทธมณฑลสาย 4 แขวงบางพรม เขตตลิ่งชัน กรุงเทพมหานคร 10170\n" +
                "เปิดบริการ : จ. - ศ. 07.00 – 18.00 น. / ส. - อา. 08.00 – 18.00 น.\n" +
                "โทร. 065 919 3991\n" ,

                "ที่อยู่ : 9, 2 ซอยพร้อมพรรค แขวงคลองตันเหนือ เขตวัฒนา กรุงเทพมหานคร 10110\n" +
                "เปิดบริการ : อ. – อา. เวลา 9.30 น. – 18.00 น.\n" +
                "โทร : 02 084 8649\n",


                "ที่อยู่ : 151/3 ซอยประเสริฐมนูกิจ 2 แขวงเสนานิคม เขตจตุจักร กรุงเทพมหานคร 10900\n" +
                "เปิดบริการ : ทุกวัน 8.00 – 22.00 น.\n" +
                "โทร. 0956156615\n" ,

                "ที่อยู่ : 9, 3 หมู่ 6 ถนนจอมทอง แขวงจอมทอง เขตจอมทอง กรุงเทพมหานคร 10150\n" +
                "เปิดบริการ : ทุกวัน 10.00 – 18.00 น.\n" +
                "โทร. 0851231386\n" ,

                "ที่อยู่ : 53 ซ. เอกมัย 12 เเขวง คลองตันเหนือ เขตวัฒนา กรุงเทพมหานคร 10110\n" +
                "เปิดบริการ :  ทุกวัน 8.00 – 18.00 น.\n" +
                "โทร. 0803624965\n" ,

                "ที่อยู่ : 01/7 ซอยรางน้ำ พญาไท ราชเทวี กรุงเทพฯ\n" +
                "เปิดบริการ : ทุกวัน 8.00 น. – 20.00 น.\n" +
                "โทร. 080 949 5326\n" ,

                "ที่อยู่ : 43/1 ซอย นราธิวาสราชนครินทร์ 7 แขวง ทุ่งมหาเมฆ เขต สาทร กรุงเทพมหานคร 10120\n" +
                "เปิดบริการ : จ. - พฤ. 8.00 -20.00 น., ส. - อา. 9.00 – 22.00 น. และ 8.00 – 22.00 น.\n" +
                "โทร. 0838264456\n" ,

                "ที่อยู่ : 15/25 สุขุมวิท 63 เอกมัย 12 หมู่บ้านสวนเจริญใจ คลองตัน, เขตวัฒนา\n" +
                "เปิดบริการ : พฤ. - จ. 10.00 – 17.00 น.\n" +
                "โทร. 020776961\n" ,

                "ที่อยู่ : 148 ถ. นาคนิวาส แขวง ลาดพร้าว เขตลาดพร้าว กรุงเทพมหานคร 10230\n" +
                "เปิดบริการ : ทุกวัน 10.00 - 20.00 น.\n" +
                "โทร. 021016410\n" ,

                "ที่อยู่ : 156 ถนน สีลม แขวง สีลม เขตบางรัก กรุงเทพมหานคร 10500\n" +
                "เปิดบริการ : ทุกวัน 9.30 – 19.30 น.\n" +
                "โทร. 0648470049\n" ,

                "ที่อยู่ : ซอยมาตานุสรณ์ แขวงบางคอแหลม เขตบางคอแหลม กรุงเทพมหานคร 10120\n" +
                "เปิดบริการ : พ. - จ. 9.00 – 17.30 น. (ปิดวันอังคาร)\n" +
                "โทร. 0813760402\n" ,

                "ที่อยู่ : Kimpton Maa-Lai Bangkok, 78 ซอยต้นสน แขวงลุมพินี เขตปทุมวัน กรุงเทพมหานคร 10330\n" +
                "เปิดบริการ : ทุกวัน 7.00 – 23.00 น.\n" +
                "โทร. 02 056 9999\n" ,

                "ที่อยู่ : 24/2 ซอยอารีย์ 4 แขวงสามเสนใน เขตพญาไท กรุงเทพมหานคร 10400\n" +
                "เปิดบริการ : ทุกวัน 7.00 – 18.00 น.\n" +
                "โทร : ไม่ระบุ\n" ,

                "ที่อยู่ : 144 ซอยโยธินพัฒนา คลองจั่น เขตบางกะปิ กรุงเทพมหานคร 10240\n" +
                "เปิดบริการ : ทุกวัน 8.00 – 20.00 น.\n" +
                "โทร : 080 221 1188\n" ,

                "ที่อยู่ : 110 ซอย สุขุมวิท 26 เขตคลองเตย กรุงเทพมหานคร 10110\n" +
                "เปิดบริการ : ทุกวัน 10.00 – 19.00 น.\n" +
                "โทร : 02 059 7760\n"
        )

    //รูป
    var photo = intArrayOf(
        R.drawable.nanahunter,
        R.drawable.patom,
        R.drawable.camin,
        R.drawable.nature,
        R.drawable.baby,
        R.drawable.other,
        R.drawable.lots,
        R.drawable.tealily,
        R.drawable.organic,
        R.drawable.brioche,
        R.drawable.tangible,
        R.drawable.craft,
        R.drawable.nana,
        R.drawable.snog,
        R.drawable.chanintr,


    )

    var recyclerView: RecyclerView? =null
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        binding = ActivitySecondBinding.inflate(layoutInflater)
        setContentView(binding.root)



        binding.recyclerView!!.layoutManager = LinearLayoutManager(this)
        val photoAdapter = MyAdapter(this,photo,cafe,place,description)
        val itemAdapter = MyAdapter(this,photo,cafe,place,description)
        val placeAdater = MyAdapter(this,photo,cafe,place,description)
        val descriptionAdapter = MyAdapter(this,photo,cafe,place,description)
        binding.recyclerView!!.adapter = photoAdapter
        binding.recyclerView!!.adapter = itemAdapter
        binding.recyclerView!!.adapter = placeAdater
        binding.recyclerView!!.adapter = descriptionAdapter


    }
}